renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
	memset(&cmd, 0, sizeof(cmd));
	memset(&ans, 0, sizeof(ans));
    memset(&sensor_points, 0, sizeof(sensor_points));
	memset(&board_info, 0, sizeof(board_info));
	memset(&schedule, 0, sizeof(schedule));
	memset(st, 0, sizeof(osens_mote_sm_state_t));

	num_rx_bytes=0;


#if MYLINKXS_REMOTE_CONTROL
    strcpy((void *)board_info.model, (void *) "ARDUINO");
    strcpy((void *)board_info.manufactor,(void *) "ARDUINO");
    board_info.sensor_id = 0x1;
    board_info.hardware_revision = 0x01;
    board_info.num_of_points = 5;
    board_info.capabilities = 0;

    sensor_points.num_of_points = 5;
    pointpos=0;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR1ONOFF");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR2_PP");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR2_MM");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR3_PP");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR3_MM");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

#endif




	return ret;
}

void osens_mote_sm(void)
{
	uint8_t ret;

#if TRACE_ON == 1
	uint8_t ls = sm_state.state;
	#endif

	ret = osens_mote_sm_table[sm_state.state].func(&sm_state);

	if (flagErrorOccurred)
	{
      //reset uart
	  uart1_clearTxInterrupts();
	  uart1_clearRxInterrupts();      // clear possible pending interrupts
	  uart1_enableInterrupts();       // Enable USCI_A1 TX & RX interrupt

	  flagErrorOccurred = 0;
	}

	switch(ret)
	{
		case OSENS_STATE_EXEC_OK:
		case OSENS_STATE_EXEC_WAIT_STOP:
			sm_state.state = osens_mote_sm_table[sm_state.state].next_state;
			break;
		case OSENS_STATE_EXEC_WAIT_OK:
			// still waiting
			break;
		case OSENS_STATE_EXEC_WAIT_ABORT:
			// wait timeout
			sm_state.state = osens_mote_sm_table[sm_state.state].abort_state;
			break;
		case OSENS_STATE_EXEC_ERROR:
		default:
			sm_state.state = osens_mote_sm_table[sm_state.state].error_state;
			break;
	}

#if TRACE_ON == 1
    printf("[SM]  %llu    (%02d) %-16s -> (%02d) %-16s\n", tick_counter, ls, sm_states_str[ls], sm_state.state,sm_states_str[sm_state.state]);

    {
        uint8_t index = 1;
        osens_point_t point;
        if (sensor_points.points[0].value.value.u8 >= 90 && sensor_points.points[1].value.value.u8 == 0)
        {
            point.value.u8 = 1;
            osens_set_pvalue(index, &point);
}

        if (sensor_points.points[0].value.value.u8 < 90 && sensor_points.points[1].value.value.u8 == 1)
{
            point.value.u8 = 0;
            osens_set_pvalue(index, &point);
        }
}
#endif

}

#if (MYLINKXS_LIGHT_CONTROL == 0)

static void osens_mote_tick(void)
{
    scheduler_push_task((task_cbt) osens_mote_sm, TASKPRIO_OSENS_MAIN);
}
#endif

#if MYLINKXS_REMOTE_CONTROL
const osens_mote_sm_table_t osens_mote_sm_table[] =
{     //{ func,                                next_state,                   abort_state,              error_state       }
		{ osens_mote_sm_func_init,             OSENS_STATE_BUILD_SCH,        OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_INIT
		{ osens_mote_sm_func_req_ver,          OSENS_STATE_WAIT_ITF_VER_ANS, OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_SEND_ITF_VER
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_ITF_VER,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_ITF_VER_ANS
		{ osens_mote_sm_func_proc_itf_ver_ans, OSENS_STATE_SEND_BRD_ID,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_ITF_VER
		{ osens_mote_sm_func_req_brd_id,       OSENS_STATE_WAIT_BRD_ID_ANS,  OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_SEND_BRD_ID
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_BRD_ID,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_BRD_ID_ANS
		{ osens_mote_sm_func_proc_brd_id_ans,  OSENS_STATE_SEND_PT_DESC,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_BRD_ID
		{ osens_mote_sm_func_req_pt_desc,      OSENS_STATE_WAIT_PT_DESC_ANS, OSENS_STATE_BUILD_SCH,    OSENS_STATE_INIT  }, // OSENS_STATE_SEND_PT_DESC
        { osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_PT_DESC,     OSENS_STATE_SEND_PT_DESC, OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_PT_DESC_ANS
		{ osens_mote_sm_func_pt_desc_ans,      OSENS_STATE_SEND_PT_DESC,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_PT_DESC
		{ osens_mote_sm_func_build_sch,        OSENS_STATE_RUN_SCH,          OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_BUILD_SCH
		{ osens_mote_sm_func_run_sch,          OSENS_STATE_RUN_SCH,          OSENS_STATE_SEND_PT_VAL,  OSENS_STATE_WR_PT }, // OSENS_STATE_RUN_SCH
		{ osens_mote_sm_func_req_pt_val,       OSENS_STATE_WAIT_PT_VAL_ANS,  OSENS_STATE_RUN_SCH,      OSENS_STATE_INIT  }, // OSENS_STATE_SEND_PT_VAL
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_PT_VAL,      OSENS_STATE_SEND_PT_VAL,  OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_PT_VAL_ANS
		{ osens_mote_sm_func_pt_val_ans,       OSENS_STATE_SEND_PT_VAL,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_PT_VAL
		{ osens_mote_sm_func_wr_pt,            OSENS_STATE_WAIT_WR_PT_ANS,   OSENS_STATE_RUN_SCH,      OSENS_STATE_INIT  }, // OSENS_STATE_WR_PT
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_WR_PT_ANS,   OSENS_STATE_WR_PT,        OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_WR_PT_ANS
		{ osens_mote_sm_func_proc_wr_pt,       OSENS_STATE_WR_PT,            OSENS_STATE_INIT,         OSENS_STATE_INIT } // OSENS_STATE_PROC_WR_PT_ANS
};
#else
const osens_mote_sm_table_t osens_mote_sm_table[] =
{     //{ func,                                next_state,                   abort_state,              error_state       }
		{ osens_mote_sm_func_init,             OSENS_STATE_SEND_ITF_VER,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_INIT
		{ osens_mote_sm_func_req_ver,          OSENS_STATE_WAIT_ITF_VER_ANS, OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_SEND_ITF_VER
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_ITF_VER,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_ITF_VER_ANS
		{ osens_mote_sm_func_proc_itf_ver_ans, OSENS_STATE_SEND_BRD_ID,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_ITF_VER
		{ osens_mote_sm_func_req_brd_id,       OSENS_STATE_WAIT_BRD_ID_ANS,  OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_SEND_BRD_ID
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_BRD_ID,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_BRD_ID_ANS
		{ osens_mote_sm_func_proc_brd_id_ans,  OSENS_STATE_SEND_PT_DESC,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_BRD_ID
		{ osens_mote_sm_func_req_pt_desc,      OSENS_STATE_WAIT_PT_DESC_ANS, OSENS_STATE_BUILD_SCH,    OSENS_STATE_INIT  }, // OSENS_STATE_SEND_PT_DESC
        { osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_PT_DESC,     OSENS_STATE_SEND_PT_DESC, OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_PT_DESC_ANS
		{ osens_mote_sm_func_pt_desc_ans,      OSENS_STATE_SEND_PT_DESC,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_PT_DESC
		{ osens_mote_sm_func_build_sch,        OSENS_STATE_RUN_SCH,          OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_BUILD_SCH
		{ osens_mote_sm_func_run_sch,          OSENS_STATE_RUN_SCH,          OSENS_STATE_SEND_PT_VAL,  OSENS_STATE_WR_PT }, // OSENS_STATE_RUN_SCH
		{ osens_mote_sm_func_req_pt_val,       OSENS_STATE_WAIT_PT_VAL_ANS,  OSENS_STATE_RUN_SCH,      OSENS_STATE_INIT  }, // OSENS_STATE_SEND_PT_VAL
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_PT_VAL,      OSENS_STATE_SEND_PT_VAL,  OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_PT_VAL_ANS
		{ osens_mote_sm_func_pt_val_ans,       OSENS_STATE_SEND_PT_VAL,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_PT_VAL
		{ osens_mote_sm_func_wr_pt,            OSENS_STATE_WAIT_WR_PT_ANS,   OSENS_STATE_RUN_SCH,      OSENS_STATE_INIT  }, // OSENS_STATE_WR_PT
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_WR_PT_ANS,   OSENS_STATE_WR_PT,        OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_WR_PT_ANS
		{ osens_mote_sm_func_proc_wr_pt,       OSENS_STATE_WR_PT,            OSENS_STATE_INIT,         OSENS_STATE_INIT } // OSENS_STATE_PROC_WR_PT_ANS
};
#endif

