renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
uint8_t osens_mote_send_frame(uint8_t *frame, uint8_t size)
{
 	uint16_t ui16Length=size;
    register uint16_t ui16Idx = 0;

    DISABLE_INTERRUPTS();
    while((ui16Idx < ui16Length))
    {
        UARTCharPut(BSP_UART_BASE, frame[ui16Idx++]);
    }
    ENABLE_INTERRUPTS();

    return ((uint8_t) ui16Length);
}

/**************************************************************************//**
* @brief    This function pushes a byte from the UART RX FIFO to the BSP UART
*           RX buffer. The function handles RX buffer wrap-around, but does not
*           handle RX buffer overflow. The function should only be called if
*           there is data in the UART RX FIFO. It modifies volatile variables
*           and should only be called when interrupts are disabled.
*
* @brief    None
******************************************************************************/
static void buBufPushByte(void)
{
    uint32_t value;

    // Push byte from RX FIFO to buffer
    value = UARTCharGetNonBlocking(OSENS_UART_BASE);

    if (num_rx_bytes < OSENS_MAX_FRAME_SIZE)
    	frame[num_rx_bytes] = (uint8_t) value;

    num_rx_bytes++;
    if (num_rx_bytes >= OSENS_MAX_FRAME_SIZE)
        num_rx_bytes = 0;
}


/**************************************************************************//**
* @brief    This function flushes the ringbuffer control structure specified
*           by \e psBuf.
*
* @param    psBuf       is a pointer to a \e tBuBuf ringbuffer structure.
*
* @return   None
******************************************************************************/
static void buBufFlush(void)
{
    // Start of critical section
    bool bIntDisabled = IntMasterDisable();

    num_rx_bytes = 0;

    if(!bIntDisabled)
    {
        IntMasterEnable();
    }
}


void uart1_isr_private(void)
{
    uint32_t ui32IntBm = UARTIntStatus(OSENS_UART_BASE, 1);
    //uint8_t dummy=0;

    UARTIntClear(OSENS_UART_BASE, (ui32IntBm & 0xF0));

    //ERROR LINE
    if (ui32IntBm & (UART_INT_BE | UART_INT_PE | UART_INT_FE))
	{
    	UARTRxErrorClear(OSENS_UART_BASE);
    	buBufFlush();
    	flagErrorOccurred = 1;
        //while(UARTCharsAvail(OSENS_UART_BASE))
        //{
        //	dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //}
	}
    else if(ui32IntBm & (UART_INT_OE))
	{    //OVERRUN
    	UARTRxErrorClear(OSENS_UART_BASE);
        buBufFlush();
    	flagErrorOccurred = 1;
    	//dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //while(UARTCharsAvail(OSENS_UART_BASE))
        //{
        //	dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //}
	}
    else if(ui32IntBm & (UART_INT_RX | UART_INT_RT))
    {
        //
        // Put received bytes into buffer
        //
        //while(UARTCharsAvail(BSP_UART_BASE) && !BU_IS_BUF_FULL(&sBuBufRx))
        while(UARTCharsAvail(OSENS_UART_BASE))
        {
            buBufPushByte();
        }


        //if (ui32IntBm & UART_INT_RT)
        //{
        //	sm_state.frame_arrived = true;
        //}

    }
    else if(ui32IntBm & UART_INT_TX)
    {
        //while(UARTSpaceAvail(BSP_UART_BASE) && (!BU_IS_BUF_EMPTY(&sBuBufTx)))
        //{
        //    buBufPopByte();
        //}
    }
}

